-- 型理論
/-
全ての 式 あるいは 項 は、それに関連した型を持つ
-/

-- 単純型理論 (Simple Type Theory)
/-
型付きラムダ計算を基礎とする論理•型システムの一種である。
型なしラムダ計算で発生する`λx. x x`のような自己適用の問題を回避するために、
すべての項に型を割り当て、型が合わないものを書きないようにしている。
ここで言う「単純」とは、型が値 (項) に依存しないことを意味する。
なお、自己適用の具体的な問題として、ラッセルのパラドックスがある。

-- ラッセルのパラドックス
「自分自身を含まない集合すべての集合」を考えると矛盾が生じる

例えば、集合 A を以下のように定義する。
A = { x | x ∉ x } (意味: 自分自身を要素として含まない集合 x、すべてを集めた集合)

この定義に基づいて、以下の仮定を考える。

仮定1: A ∈ A (集合 A は自分自身を要素として含む)
-> A ∈ A であると仮定すると、A の定義により A ∉ A となる。これは矛盾である。

仮定2: A ∉ A (集合 A は自分自身を要素として含まない)
-> A ∉ A であると仮定すると、A の定義により A ∈ A となる。これも矛盾である。

従って、どちらの仮定も矛盾を引き起こすため、集合 A の定義は不適切であることがわかる。

-- 単純型理論でラッセルのパラドックスを回避している具体例
x ∈ x を考える。
これを型理論で書くと、 x(x) となる。
この式は、x が関数 (a -> b) であることを要求するが、
同時に x が引数 (a) としても使われているため、型エラーとなる。
よって、単純型理論では自己適用ができないため、ラッセルのパラドックスを回避することができる。
-/

-- def <項の名前 (識別子)> : <項の型> := <項の定義式>
def m : Nat := 1 -- `m`は自然数型の項で、値は1である
def b1 : Bool := true -- `b1`はブール型の項で、値はtrueである
def b2 : Bool := false -- `b2`はブール型の項で、値はfalseである

-- 項の型のチェック
-- #check <項の名前 (識別子)>
#check m -- `m`の型はNatである
#check b1 && b2 -- `b1 && b2`の型はBoolである
#check b1 || b2 -- `b1 || b2`の型はBoolである

-- 項を評価 (計算) する
-- #eval <項の名前 (識別子)>
#eval m -- `m`の値は1である
#eval b1 && b2 -- `b1 && b2`の値はfalseである
#eval b1 || b2 -- `b1 || b2`の値はtrueである

-- 特殊なUnicode記号への変換コマンド
/-
`\to` →
`\r` →
`\times` ×
`\a` α
`\b` β
`\g` γ
`\N` ℕ
`\Q` ℚ
`\R` ℝ
`\C` ℂ

上記以外にも複数の特殊なUnicode記号への変換コマンドが存在する。
-/

-- 関数型
/-
`a -> b` は関数型を表す
つまり、引数の型が `a` で戻り値の型が `b` である関数の型を示す。

複数の引数を取る関数は、仮引数を直積型 で表現するのではなく、
カリー化された表現を使用する方が良いとされる。
理由としては、カリー化された表現だと部分適用が可能となるためである。

- 加算の型の例
例えば、加算関数 `add` は、2つの自然数を引数に取り、自然数を返す関数である。
この関数の型は `Nat × Nat -> Nat` と表すこともできるが、
カリー化された表現では `Nat -> Nat -> Nat` と表すことができる。
-/

-- 直積型
def pair : Nat × Nat := (1, 2) -- `pair`は自然数のペアで、値は(1, 2)である
#check pair -- `pair`の型はNat × Natである
-- 直積型の要素へのアクセス
#eval pair.1 -- `pair.1`の値は1である
#eval pair.2 -- `pair.2`の値は2である

-- 項としての型
/-
`Nat`や`Bool`などの型も、実は項である。
これらの型は、型の型である `Type` の要素である。
つまり、`Nat : Type` や `Bool : Type` といった関係が成り立つ。
-/
#check Nat -- `Nat`の型はTypeである
#check Bool -- `Bool`の型はTypeである
#check Nat → Bool -- `Nat → Bool`の型はTypeである
#check Nat × Bool -- `Nat × Bool`の型はTypeである

-- 型を表す新しい定数の宣言は、以下のように行うことができる。
def MyNat : Type := Nat -- `MyNat`は型で、値は`Nat`である
#check MyNat -- `MyNat`の型はTypeである
def MyList : Type → Type := List -- `MyList`は型を引数に取る型で、値は`List`である
#check MyList -- `MyList`の型はType → Typeである
    #check MyList Nat -- `MyList Nat`の型はTypeである

-- 宇宙を表現するには
/-
型の型の... のような表現を 宇宙 と呼ぶ。
そして、Lean では、 非累積的宇宙の可算無限階層 を採用している。
※ 可算無限と非可算無限の違いは、自然数 ℕ と全単射が存在するかどうかである。
つまり、`Type 0`、`Type 1`、`Type 2`、... といった階層が存在し、
`Type n` は `Type (n+1)` の要素であるという関係が成り立つ。
無限階層にすることによって、型理論におけるラッセルのパラドックス
(ジラールのパラドックス) を回避することができる。
要は「すべての型を含む宇宙 `U`」を作ろうとして発生す`U : U`のような
自己言及的な定義を避けるために、無限に階層化された宇宙を採用している。
-/
#check Type -- `Type`の型はType 1である
#check Type 0 -- `Type 0`の型はType 1である
#check Type 1 -- `Type 1`の型はType 2である
#check Type 2 -- `Type 2`の型はType 3である
-- ... といった具合に、無限に階層が続く
/-
Type 0 ... True のような具体的な型は、Type 0 である。
Type 1 ... bool や Nat のような型は、Type 1 である。
Type 2 ... Nat → Type のような型は、Type 2 である。
Type 3 ... Type → Type 1 のような型は、Type 3 である
... といった具合に、無限に階層が続く
-/

-- 型の宇宙に対する多相
/-
いくつかの演算子は、型の宇宙に対する多相を持たなければならない。
例えば、多相な関数 `List` は、`α` が型 `Type u`のとき、
`List α` は型 `Type u` でなければならない。
ここで、 `u` は宇宙レベルを表す変数である。
-/
#check List -- `List`の型は `Type u → Type u` である
-- output: `List.{u} (α : Type u) : Type u`

-- `universe` コマンドを使用して、宇宙レベルを明示的に指定することもできる。
universe u -- `u`は宇宙レベルを表す変数である
def MyList' (α : Type u) : Type u := List α -- `MyList'`は型を引数に取る型で、値は`List`である
#check MyList' -- `MyList'`の型は `Type u → Type u` である
-- output: `MyList'.{u} (α : Type u) : Type u`
#check MyList' Nat -- `MyList' Nat`の型は `Type` (Type 1) である

