-- 参考サイト
/-
- https://speakerdeck.com/unaoya/zheng-ming-zhi-yuan-xi-leanniru-men-siyou
-/

-- 一行コメントアウト

/-
複数行のコメントアウト
-/

-- 項
/-
項aが型Aを持つことを `a : A` と書く。
(項は必ず型を持つ)
-/

-- 項を定義する
/-
leanは、項を定義するための def というキーワードを持つ。
`def a : A := b`
と書くと、項a が型A を持ち、項b によって定義されることを意味する。

以下は、項n を Nat型 の 項1 として定義する例。
-/
def n : Nat := 1


/-
以下は、項one_equal_oneを、
1 = 1 という型の Eq.refl 1 という項として定義する例。

※ Eq.refl は、Nat -> Nat という関数型の項で、
それに Nat型の項 1 を適用した項となっている。
-/
def one_equal_one: 1 = 1 := Eq.refl 1

-- 関数型
/-
項f が 型A から 型B への関数型を持つことを、
`f : A → B` と書く。
-/

-- 2倍 を定義する。
def twice : Nat -> Nat := fun n => n + n
-- 以下のように定義することもできる。
/-
関数型の項 f: A -> B と 項 a: A があるとき、
f a : B と書くことができる。
従って、以下のように定義することもできる。
-/
def twice' (n : Nat) : Nat := n + n

-- 「関数」 と 命題の「ならば」 との関係
/-
命題 P, Q があるとき、P → Q という型は、
P ならば Q であることを意味する。
関数の項 `f: P → Q` は、Pの証明 `h : P` を与えると、
Qの証明 `f h : Q` を返す関数を解釈すれば良い。

プログラム ... 関数の組み合わせ (正し、実際の値の対応関係が重要である)
証明 ... 命題の「ならば」の組み合わせ (正し、型だけを気にしている)
-/

-- 「直積/直和」 と 命題の 「かつ/または」 との関係
/-
-- 直積
命題 P, Q があるとき、R -> P × Q という型は、
R -> P と R -> Q を用意すれば、R -> P × Q であることを意味する。
つまり、R ならば P かつ Q の証明は、R ならば P の証明と R ならば Q の証明の
組を用意すれば良い。

-- 直和
命題 P, Q があるとき、R -> P + Q という型は、
R -> P と R -> Q のどちらかを用意すれば、R -> P + Q であることを意味する。
つまり、R ならば P または Q の証明は、R ならば P の証明か R ならば Q の証明の
どちらかを用意すれば良い。(R -> P または R -> Q のどちらかが証明可能であれば良い。)
-/
